/*************************************************************************
> File Name: chinaunion.c
> Author: zhonghua
> Mail:   zhonghua-881008@163.com 
> Created Time: 2015年02月22日 星期日 16时59分40秒
*************************************************************************/

#include <stdio.h>

int main()
{
	int i=0;
	float sum=0;
	printf("请输入您每月所需的流量数(单位:MB):");
	scanf("%d",&i);

	if(i<=100)
	{
		sum=0.15*i;
		sum*=0.7;
		printf("您每月所需要花费的流量费用为(单位:元): %f\n", sum);
		return 0;
	}

	if(i>100 && i<=500)
	{
		sum=0.15*100+0.07*(i-100);
		sum*=0.7;
		printf("您每月所需要花费的流量费用为(单位:元): %f\n", sum);
		return 0;
	}

	if(i>500)
	{
		sum=0.15*100+0.07*400+0.05*(i-500);
		sum*=0.7;
		printf("您每月所需要花费的流量费用为(单位:元): %f\n", sum);
		return 0;
	}
}
